sterentev/atdf-device-asm-include/inc/ATtiny841.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	TCCR2A		= 0xCA		; [MEMORY MAPPED] Timer/Counter2 Control Register A
.equ	TCCR2B		= 0xC9		; [MEMORY MAPPED] Timer/Counter2 Control Register B
.equ	TCCR2C		= 0xC8		; [MEMORY MAPPED] Timer/Counter2 Control Register C
.equ	TCNT2		= 0xC6		; [MEMORY MAPPED] Timer/Counter2  Bytes
.equ	OCR2A		= 0xC4		; [MEMORY MAPPED] Timer/Counter2 Output Compare Register A  Bytes
.equ	OCR2B		= 0xC2		; [MEMORY MAPPED] Timer/Counter2 Output Compare Register B  Bytes
.equ	ICR2		= 0xC0		; [MEMORY MAPPED] Timer/Counter2 Input Capture Register  Bytes
.equ	SPCR		= 0xB2		; [MEMORY MAPPED] SPI Control Register
.equ	SPSR		= 0xB1		; [MEMORY MAPPED] SPI Status Register
.equ	SPDR		= 0xB0		; [MEMORY MAPPED] SPI Data Register
.equ	TWSCRA		= 0xA5		; [MEMORY MAPPED] TWI Slave Control Register A
.equ	TWSCRB		= 0xA4		; [MEMORY MAPPED] TWI Slave Control Register B
.equ	TWSSRA		= 0xA3		; [MEMORY MAPPED] TWI Slave Status Register A
.equ	TWSA		= 0xA2		; [MEMORY MAPPED] TWI Slave Address Register
.equ	TWSAM		= 0xA1		; [MEMORY MAPPED] TWI Slave Address Mask Register
.equ	TWSD		= 0xA0		; [MEMORY MAPPED] TWI Slave Data Register
.equ	UCSR1A		= 0x96		; [MEMORY MAPPED] USART Control and Status Register A
.equ	UCSR1B		= 0x95		; [MEMORY MAPPED] USART Control and Status Register B
.equ	UCSR1C		= 0x94		; [MEMORY MAPPED] USART Control and Status Register C
.equ	UCSR1D		= 0x93		; [MEMORY MAPPED] USART Control and Status Register D
.equ	UBRR1		= 0x91		; [MEMORY MAPPED] USART Baud Rate Register Bytes
.equ	UDR1		= 0x90		; [MEMORY MAPPED] USART I/O Data Register
.equ	UCSR0A		= 0x86		; [MEMORY MAPPED] USART Control and Status Register A
.equ	UCSR0B		= 0x85		; [MEMORY MAPPED] USART Control and Status Register B
.equ	UCSR0C		= 0x84		; [MEMORY MAPPED] USART Control and Status Register C
.equ	UCSR0D		= 0x83		; [MEMORY MAPPED] USART Control and Status Register D
.equ	UBRR0		= 0x81		; [MEMORY MAPPED] USART Baud Rate Register Bytes
.equ	UDR0		= 0x80		; [MEMORY MAPPED] USART I/O Data Register
.equ	OSCCAL1		= 0x77		; [MEMORY MAPPED] Oscillator Calibration Register 32kHz
.equ	OSCTCAL0B	= 0x76		; [MEMORY MAPPED] Oscillator Temperature Calibration Register B
.equ	OSCTCAL0A	= 0x75		; [MEMORY MAPPED] Oscillator Temperature Calibration Register A
.equ	OSCCAL0		= 0x74		; [MEMORY MAPPED] Oscillator Calibration Register 8MHz
.equ	CLKPR		= 0x73		; [MEMORY MAPPED] Clock Prescale Register
.equ	CLKCR		= 0x72		; [MEMORY MAPPED] Clock Control Register
.equ	CCP		= 0x71		; [MEMORY MAPPED] Configuration Change Protection
.equ	PRR		= 0x70		; [MEMORY MAPPED] Power Reduction Register
.equ	PHDE		= 0x6A		; [MEMORY MAPPED] Port High Drive Enable Register
.equ	TOCPMSA1	= 0x68		; [MEMORY MAPPED] Timer Output Compare Pin Mux Selection 1
.equ	TOCPMSA0	= 0x67		; [MEMORY MAPPED] Timer Output Compare Pin Mux Selection 0
.equ	TOCPMCOE	= 0x66		; [MEMORY MAPPED] Timer Output Compare Pin Mux Channel Output Enable
.equ	REMAP		= 0x65		; [MEMORY MAPPED] Remap Port Pins
.equ	PORTCR		= 0x64		; [MEMORY MAPPED] Port Control Register
.equ	PUEA		= 0x63		; [MEMORY MAPPED] Pull-up Enable Control Register
.equ	PUEB		= 0x62		; [MEMORY MAPPED] Pull-up Enable Control Register
.equ	DIDR1		= 0x61		; [MEMORY MAPPED] Digital Input Disable Register 1
.equ	DIDR0		= 0x60		; [MEMORY MAPPED] Digital Input Disable Register 0
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	OCR0B		= 0x3C		; Timer/Counter0 Output Compare Register B
.equ	GIMSK		= 0x3B		; General Interrupt Mask Register
.equ	GIFR		= 0x3A		; General Interrupt Flag register
.equ	TIMSK0		= 0x39		; Timer/Counter Interrupt Mask Register
.equ	TIFR0		= 0x38		; Timer/Counter0 Interrupt Flag Register
.equ	SPMCSR		= 0x37		; Store Program Memory Control and Status Register
.equ	OCR0A		= 0x36		; Timer/Counter0 Output Compare Register A
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	TCCR0B		= 0x33		; Timer/Counter Control Register B
.equ	TCNT0		= 0x32		; Timer/Counter0
.equ	TCCR0A		= 0x30		; Timer/Counter  Control Register A
.equ	TCCR1A		= 0x2F		; Timer/Counter1 Control Register A
.equ	TCCR1B		= 0x2E		; Timer/Counter1 Control Register B
.equ	TCNT1		= 0x2C		; Timer/Counter1  Bytes
.equ	OCR1A		= 0x2A		; Timer/Counter1 Output Compare Register A  Bytes
.equ	OCR1B		= 0x28		; Timer/Counter1 Output Compare Register B  Bytes
.equ	ICR1		= 0x24		; Timer/Counter1 Input Capture Register  Bytes
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	TCCR1C		= 0x22		; Timer/Counter1 Control Register C
.equ	WDTCSR		= 0x21		; Watchdog Timer Control and Status Register
.equ	PCMSK1		= 0x20		; Pin Change Enable Mask 1
.equ	EEAR		= 0x1E		; EEPROM Address Register  Bytes
.equ	EEDR		= 0x1D		; EEPROM Data Register
.equ	EECR		= 0x1C		; EEPROM Control Register
.equ	PORTA		= 0x1B		; Port A Data Register
.equ	DDRA		= 0x1A		; Data Direction Register, Port A
.equ	PINA		= 0x19		; Port A Input Pins
.equ	PORTB		= 0x18		; Input Pins, Port B
.equ	DDRB		= 0x17		; Data Direction Register, Port B
.equ	PINB		= 0x16		; Port B Data register
.equ	GPIOR2		= 0x15		; General Purpose I/O Register 2
.equ	GPIOR1		= 0x14		; General Purpose I/O Register 1
.equ	GPIOR0		= 0x13		; General Purpose I/O Register 0
.equ	PCMSK0		= 0x12		; Pin Change Enable Mask 0
.equ	TIMSK2		= 0x11		; Timer/Counter2 Interrupt Mask Register
.equ	TIFR2		= 0x10		; Timer/Counter Interrupt Flag register
.equ	TIMSK1		= 0x0F		; Timer/Counter1 Interrupt Mask Register
.equ	TIFR1		= 0x0E		; Timer/Counter Interrupt Flag register
.equ	ACSR1B		= 0x0D		; Analog Comparator 1 Control And Status Register B
.equ	ACSR1A		= 0x0C		; Analog Comparator 1 Control And Status Register A
.equ	ACSR0B		= 0x0B		; Analog Comparator 0 Control And Status Register B
.equ	ACSR0A		= 0x0A		; Analog Comparator 0 Control And Status Register A
.equ	ADMUXA		= 0x09		; The ADC multiplexer Selection Register A
.equ	ADMUXB		= 0x08		; The ADC multiplexer Selection Register B
.equ	ADC		= 0x06		; ADC Data Register  Bytes
.equ	ADCSRA		= 0x05		; The ADC Control and Status register
.equ	ADCSRB		= 0x04		; ADC Control and Status Register B


