sterentev/atdf-device-asm-include/inc/ATtiny841.inc
; ----------	Register TCCR2A bits		------------------------
.equ	COM2A_MASK	= 0xC0		;      - Compare Output Mode 2A, bits (2 bits)
.equ	COM2A0		= 6		;          COM2A BIT0 position
.equ	COM2B_MASK	= 0x30		;      - Compare Output Mode 2B, bits (2 bits)
.equ	COM2B0		= 4		;          COM2B BIT0 position
.equ	TCCR2A_WGM2_MASK= 0x03		;      - Pulse Width Modulator Select Bits (2 bits)
.equ	TCCR2A_WGM20	= 0		;          TCCR2A_WGM2 BIT0 position

; ----------	Register TCCR2B bits		------------------------
.equ	ICNC2		= 7		; 0x80 - Input Capture 2 Noise Canceler
.equ	ICES2		= 6		; 0x40 - Input Capture 2 Edge Select
.equ	TCCR2B_WGM2_MASK= 0x18		;      - Waveform Generation Mode Bits (2 bits)
.equ	TCCR2B_WGM20	= 3		;          TCCR2B_WGM2 BIT0 position
.equ	CS2_MASK	= 0x07		;      - Clock Select bits (3 bits)
.equ	CS20		= 0		;          CS2 BIT0 position
; ::::  CS2	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCCR2C bits		------------------------
.equ	FOC2A		= 7		; 0x80 - Force Output Compare for Channel A
.equ	FOC2B		= 6		; 0x40 - Force Output Compare for Channel B

; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
;.equ	PSR		= 0		; 0x01 - Prescaler Reset Timer/CounterN



; ====	TC8 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TIMSK0 bits		------------------------
.equ	OCIE0B		= 2		; 0x04 - Timer/Counter0 Output Compare Match B Interrupt Enable
.equ	OCIE0A		= 1		; 0x02 - Timer/Counter0 Output Compare Match A Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Timer/Counter0 Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	OCF0B		= 2		; 0x04 - Timer/Counter0 Output Compare Flag B
.equ	OCF0A		= 1		; 0x02 - Timer/Counter0 Output Compare Flag A
.equ	TOV0		= 0		; 0x01 - Timer/Counter0 Overflow Flag

; ----------	Register TCCR0A bits		------------------------
.equ	COM0A_MASK	= 0xC0		;      - Compare Match Output A Mode bits (2 bits)
.equ	COM0A0		= 6		;          COM0A BIT0 position
.equ	COM0B_MASK	= 0x30		;      - Compare Match Output B Mode bits (2 bits)
.equ	COM0B0		= 4		;          COM0B BIT0 position
.equ	WGM0_MASK	= 0x03		;      - Waveform Generation Mode bits (2 bits)
.equ	WGM00		= 0		;          WGM0 BIT0 position

; ----------	Register TCCR0B bits		------------------------
.equ	FOC0A		= 7		; 0x80 - Force Output Compare A
.equ	FOC0B		= 6		; 0x40 - Force Output Compare B
.equ	WGM02		= 3		; 0x08 - Waveform Generation Mode bit 2
.equ	CS0_MASK	= 0x07		;      - Clock Select bits (3 bits)
.equ	CS00		= 0		;          CS0 BIT0 position
; ::::  CS0	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
;.equ	PSR		= 0		; 0x01 - Prescaler Reset Timer/CounterN



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register MCUCR bits		------------------------
.equ	ISC01		= 1		; 0x02 - Interrupt Sense Control 0 Bit 1
.equ	ISC00		= 0		; 0x01 - Interrupt Sense Control 0 Bit 0
; ::::  ISC00	>>>> This is a part of INTERRUPT_SENSE_CONTROL enum (see complete values list below)

; ----------	Register GIMSK bits		------------------------
.equ	INT0		= 6		; 0x40 - External Interrupt Request 0 Enable
.equ	PCIE_MASK	= 0x30		;      - Pin Change Interrupt Enables (2 bits)
.equ	PCIE0		= 4		;          PCIE BIT0 position

; ----------	Register GIFR bits		------------------------
.equ	INTF0		= 6		; 0x40 - External Interrupt Flag 0
.equ	PCIF_MASK	= 0x30		;      - Pin Change Interrupt Flags (2 bits)
.equ	PCIF0		= 4		;          PCIF BIT0 position

; ----------	Register PCMSK1 bits		------------------------
.equ	PCINT8		= 0		; 0x01 - Pin Change Enable Mask 1 Bit 0
.equ	PCINT9		= 1		; 0x02 - Pin Change Enable Mask 1 Bit 1
.equ	PCINT10		= 2		; 0x04 - Pin Change Enable Mask 1 Bit 2
.equ	PCINT11		= 3		; 0x08 - Pin Change Enable Mask 1 Bit 3

; ----------	Register PCMSK0 bits		------------------------
.equ	PCINT0		= 0		; 0x01 - Pin Change Enable Mask 0 Bit 0
.equ	PCINT1		= 1		; 0x02 - Pin Change Enable Mask 0 Bit 1
.equ	PCINT2		= 2		; 0x04 - Pin Change Enable Mask 0 Bit 2
.equ	PCINT3		= 3		; 0x08 - Pin Change Enable Mask 0 Bit 3
.equ	PCINT4		= 4		; 0x10 - Pin Change Enable Mask 0 Bit 4
.equ	PCINT5		= 5		; 0x20 - Pin Change Enable Mask 0 Bit 5
.equ	PCINT6		= 6		; 0x40 - Pin Change Enable Mask 0 Bit 6
.equ	PCINT7		= 7		; 0x80 - Pin Change Enable Mask 0 Bit 7



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register PRR bits		------------------------
.equ	PRTWI		= 7		; 0x80 - Power Reduction TWI
.equ	PRUSART1	= 6		; 0x40 - Power Reduction USART1
.equ	PRUSART0	= 5		; 0x20 - Power Reduction USART0
.equ	PRSPI		= 4		; 0x10 - Power Reduction SPI
.equ	PRTIM2		= 3		; 0x08 - Power Reduction Timer/Counter2
.equ	PRTIM1		= 2		; 0x04 - Power Reduction Timer/Counter1
.equ	PRTIM0		= 1		; 0x02 - Power Reduction Timer/Counter0
.equ	PRADC		= 0		; 0x01 - Power Reduction ADC

; ----------	Register CLKPR bits		------------------------
.equ	CLKPS_MASK	= 0x0F		;      - Clock Prescaler Select Bits (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128
;			0x08		; 256

; ----------	Register CLKCR bits		------------------------
.equ	OSCRDY		= 7		; 0x80 - Oscillator Ready
.equ	CSTR		= 6		; 0x40 - Clock Switch Trigger
.equ	CKOUTC		= 5		; 0x20 - Clock Output (Copy). Active low.
.equ	SUT		= 4		; 0x10 - Start-up Time
.equ	CKSEL_MASK	= 0x0F		;      - Clock Select Bits (4 bits)
.equ	CKSEL0		= 0		;          CKSEL BIT0 position

; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	SE		= 5		; 0x20 - Sleep Enable
.equ	SM_MASK		= 0x18		;      - Sleep Mode Select Bits (2 bits)
.equ	SM0		= 3		;          SM BIT0 position
.equ	ISC0_MASK	= 0x03		;      - Interrupt Sense Control 0 bits (2 bits)
;.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x08		; ADC Noise Reduction (If Available)
;			0x10		; Power Down
;			0x18		; Standby

