sterentev/atdf-device-asm-include/inc/ATtiny841.inc
; ----------	Register MCUSR bits		------------------------
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register SPMCSR bits		------------------------
.equ	RSIG		= 5		; 0x20 - Read Device Signature Imprint Table
.equ	CTPB		= 4		; 0x10 - Clear Temporary Page Buffer
.equ	RFLB		= 3		; 0x08 - Read Fuse and Lock Bits
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store program Memory Enable



; ====	TOCPM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TOCPMSA1 bits		------------------------
.equ	TOCC7S_MASK	= 0xC0		;      - Timer Output Compare Channel 7 Selection Bits (2 bits)
.equ	TOCC7S0		= 6		;          TOCC7S BIT0 position
.equ	TOCC6S_MASK	= 0x30		;      - Timer Output Compare Channel 6 Selection Bits (2 bits)
.equ	TOCC6S0		= 4		;          TOCC6S BIT0 position
.equ	TOCC5S_MASK	= 0x0C		;      - Timer Output Compare Channel 5 Selection Bits (2 bits)
.equ	TOCC5S0		= 2		;          TOCC5S BIT0 position
.equ	TOCC4S_MASK	= 0x03		;      - Timer Output Compare Channel 4 Selection Bits (2 bits)
.equ	TOCC4S0		= 0		;          TOCC4S BIT0 position

; ----------	Register TOCPMSA0 bits		------------------------
.equ	TOCC3S_MASK	= 0xC0		;      - Timer Output Compare Channel 3 Selection Bits (2 bits)
.equ	TOCC3S0		= 6		;          TOCC3S BIT0 position
.equ	TOCC2S_MASK	= 0x30		;      - Timer Output Compare Channel 2 Selection Bits (2 bits)
.equ	TOCC2S0		= 4		;          TOCC2S BIT0 position
.equ	TOCC1S_MASK	= 0x0C		;      - Timer Output Compare Channel 1 Selection Bits (2 bits)
.equ	TOCC1S0		= 2		;          TOCC1S BIT0 position
.equ	TOCC0S_MASK	= 0x03		;      - Timer Output Compare Channel 0 Selection Bits (2 bits)
.equ	TOCC0S0		= 0		;          TOCC0S BIT0 position

; ----------	Register TOCPMCOE bits		------------------------
.equ	TOCC7OE		= 7		; 0x80 - Timer Output Compare Channel 7 Output Enable
.equ	TOCC6OE		= 6		; 0x40 - Timer Output Compare Channel 6 Output Enable
.equ	TOCC5OE		= 5		; 0x20 - Timer Output Compare Channel 5 Output Enable
.equ	TOCC4OE		= 4		; 0x10 - Timer Output Compare Channel 4 Output Enable
.equ	TOCC3OE		= 3		; 0x08 - Timer Output Compare Channel 3 Output Enable
.equ	TOCC2OE		= 2		; 0x04 - Timer Output Compare Channel 2 Output Enable
.equ	TOCC1OE		= 1		; 0x02 - Timer Output Compare Channel 1 Output Enable
.equ	TOCC0OE		= 0		; 0x01 - Timer Output Compare Channel 0 Output Enable



; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	:::: bitfield values
;			0x00		; fcl/4
;			0x01		; fcl/16
;			0x02		; fcl/64
;			0x03		; fcl/128

; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit

; ----------	Register REMAP bits		------------------------
.equ	SPIMAP		= 1		; 0x02 - SPI Pin Mapping




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  INTERRUPT_SENSE_CONTROL	:::: values
;			0b00		; Low Level of INTX
;			0b01		; Reserved
;			0b10		; Falling Edge of INTX
;			0b11		; Rising Edge of INTX



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 30
.equ	INT_VECTORS_SIZE	= 0x3C
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	PCINT0		; Pin Change Interrupt Request 0
;	3	PCINT1		; Pin Change Interrupt Request 1
;	4	WDT		; Watchdog Time-out Interrupt
;	5	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	6	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	7	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	8	TIMER1_OVF	; Timer/Counter1 Overflow
;	9	TIMER0_COMPA	; TimerCounter0 Compare Match A
;	10	TIMER0_COMPB	; TimerCounter0 Compare Match B
;	11	TIMER0_OVF	; Timer/Counter0 Overflow
;	12	ANA_COMP0	; Analog Comparator 0
;	13	ADC		; ADC Conversion Complete
;	14	EE_RDY		; EEPROM Ready
;	15	ANA_COMP1	; Analog Comparator 1
;	16	TIMER2_CAPT	; Timer/Counter2 Capture Event
;	17	TIMER2_COMPA	; Timer/Counter2 Compare Match A
;	18	TIMER2_COMPB	; Timer/Counter2 Compare Match B
;	19	TIMER2_OVF	; Timer/Counter2 Overflow
;	20	SPI		; Serial Peripheral Interface
;	21	USART0_START	; USART0, Start
;	22	USART0_RX	; USART0, Rx Complete
;	23	USART0_UDRE	; USART0 Data Register Empty
;	24	USART0_TX	; USART0, Tx Complete
;	25	USART1_START	; USART1, Start
;	26	USART1_RX	; USART1, Rx Complete
;	27	USART1_UDRE	; USART1 Data Register Empty
;	28	USART1_TX	; USART1, Tx Complete
;	29	TWI_SLAVE	; Two-wire Serial Interface


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	INT_RESET	; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		rjmp	INT_INT0	; INT0		 - External Interrupt Request 0
;#		rjmp	INT_PCINT0	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; WDT		 - Watchdog Time-out Interrupt
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - TimerCounter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - TimerCounter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; ANA_COMP0	 - Analog Comparator 0
;#		reti			; ADC		 - ADC Conversion Complete
;#		rjmp	INT_EE_RDY	; EE_RDY	 - EEPROM Ready
;#		reti			; ANA_COMP1	 - Analog Comparator 1
;#		reti			; TIMER2_CAPT	 - Timer/Counter2 Capture Event
;#		reti			; TIMER2_COMPA	 - Timer/Counter2 Compare Match A
;#		reti			; TIMER2_COMPB	 - Timer/Counter2 Compare Match B
;#		reti			; TIMER2_OVF	 - Timer/Counter2 Overflow
;#		reti			; SPI		 - Serial Peripheral Interface
;#		reti			; USART0_START	 - USART0, Start
;#		reti			; USART0_RX	 - USART0, Rx Complete
;#		reti			; USART0_UDRE	 - USART0 Data Register Empty
;#		reti			; USART0_TX	 - USART0, Tx Complete
;#		reti			; USART1_START	 - USART1, Start
;#		reti			; USART1_RX	 - USART1, Rx Complete
;#		reti			; USART1_UDRE	 - USART1 Data Register Empty
;#		reti			; USART1_TX	 - USART1, Tx Complete
;#		reti			; TWI_SLAVE	 - Two-wire Serial Interface
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	INT_RESET:
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY841_INC_ */

; ************************ END OF FILE *********************************

